
weather_code_descriptions = {
  "0": "Ясно",
  "1": "Частично облачно",
  "2": "Облачно",
  "3": "Пасмурно",
  "45": "Туман",
  "48": "Отложение изморози",
  "51": "Легкая морось",
  "53": "Умеренная морось",
  "55": "Сильная морось",
  "56": "Легкая ледяная морось",
  "57": "Сильная ледяная морось",
  "61": "Легкий дождь",
  "63": "Умеренный дождь",
  "65": "Сильный дождь",
  "66": "Легкий ледяной дождь",
  "67": "Сильный ледяной дождь",
  "71": "Легкий снегопад",
  "73": "Умеренный снегопад",
  "75": "Сильный снегопад",
  "77": "Снежные зерна",
  "80": "Легкий ливень",
  "81": "Умеренный ливень",
  "82": "Сильный ливень",
  "85": "Легкий снегопад",
  "86": "Сильный снегопад",
  "95": "Гроза",
  "96": "Гроза с легким градом",
  "99": "Гроза с сильным градом"
}


weather_codes_affecting_connection = [
    45,  # Туман
    48,  # Отложение изморози
    55,  # Сильная морось
    56,  # Легкая ледяная морось
    57,  # Сильная ледяная морось
    63,  # Умеренный дождь
    65,  # Сильный дождь
    66,  # Легкий ледяной дождь
    67,  # Сильный ледяной дождь
    73,  # Умеренный снегопад
    75,  # Сильный снегопад
    80,  # Легкий ливень
    81,  # Умеренный ливень
    82,  # Сильный ливень
    85,  # Легкий снегопад
    86,  # Сильный снегопад
    95,  # Гроза
    96,  # Гроза с легким градом
    99   # Гроза с сильным градом
]
