
weather_code_descriptions = {
  "0": "Ясно",
  "1": "Частично облачно",
  "2": "Облачно",
  "3": "Пасмурно",
  "45": "Туман",
  "48": "Отложение изморози",
  "51": "Легкая морось",
  "53": "Умеренная морось",
  "55": "Сильная морось",
  "56": "Легкая ледяная морось",
  "57": "Сильная ледяная морось",
  "61": "Легкий дождь",
  "63": "Умеренный дождь",
  "65": "Сильный дождь",
  "66": "Легкий ледяной дождь",
  "67": "Сильный ледяной дождь",
  "71": "Легкий снегопад",
  "73": "Умеренный снегопад",
  "75": "Сильный снегопад",
  "77": "Снежные зерна",
  "80": "Легкий ливень",
  "81": "Умеренный ливень",
  "82": "Сильный ливень",
  "85": "Легкий снегопад",
  "86": "Сильный снегопад",
  "95": "Гроза",
  "96": "Гроза с легким градом",
  "99": "Гроза с сильным градом"
}


categories = {
        'clear': [0],
        'cloudy': [1, 2, 3],
        'rain_drizzle': [51, 53, 55, 56, 57, 61, 63, 65, 66, 67, 80, 81, 82 ,45],
        'snow': [71, 73, 75, 77, 85, 86, 48],
        # 'thunderstorm': [95, 96, 99]
    }

groza_codes = [95, 96, 99]
rain_codes = [51, 53, 55, 56, 57, 61, 63, 65, 66, 67, 80, 81, 82, 85, 86]


weather_codes_affecting_connection = [
    45,  # Туман
    48,  # Отложение изморози
    55,  # Сильная морось
    56,  # Легкая ледяная морось
    57,  # Сильная ледяная морось
    63,  # Умеренный дождь
    65,  # Сильный дождь
    66,  # Легкий ледяной дождь
    67,  # Сильный ледяной дождь
    73,  # Умеренный снегопад
    75,  # Сильный снегопад
    80,  # Легкий ливень
    81,  # Умеренный ливень
    82,  # Сильный ливень
    85,  # Легкий снегопад
    86,  # Сильный снегопад
    95,  # Гроза
    96,  # Гроза с легким градом
    99   # Гроза с сильным градом
]


regions_coords = {
    "Алтайский край": 
    {"latitude": 53.3478, "longitude": 83.7787},  # Барнаул
    "Амурская область": 
    {"latitude": 50.5520, "longitude": 127.5379},  # Благовещенск
    "Архангельская область": 
    {"latitude": 64.5393, "longitude": 40.5152},  # Архангельск
    "Астраханская область": 
    {"latitude": 46.3477, "longitude": 48.0330},  # Астрахань
    "Брянская область": 
    {"latitude": 53.2521, "longitude": 34.3717},  # Брянск
    "Владимирская область": 
    {"latitude": 56.1291, "longitude": 40.4070},  # Владимир
    "Волгоградская область": 
    {"latitude": 48.7080, "longitude": 44.5133},  # Волгоград
    "Вологодская область": 
    {"latitude": 59.2205, "longitude": 39.8915},  # Вологда
    "Воронежская область": 
    {"latitude": 51.6608, "longitude": 39.2003},  # Воронеж
    "Забайкальский край": 
    {"latitude": 52.0339, "longitude": 113.4996},  # Чита
    "Ивановская область": 
    {"latitude": 56.9995, "longitude": 40.9730},  # Иваново
    "Иркутская область": 
    {"latitude": 52.2871, "longitude": 104.3059},  # Иркутск
    "Кабардино-Балкарская Республика": 
    {"latitude": 43.5994, "longitude": 43.5853},  # Нальчик
    "Карачаево-Черкесская Республика": 
    {"latitude": 44.2242, "longitude": 41.9615},  # Черкесск
    "Кемеровская область": 
    {"latitude": 55.3540, "longitude": 86.0875},  # Кемерово
    "Кировская область": 
    {"latitude": 58.6037, "longitude": 49.6676},  # Киров
    "Краснодарский край":
    {"latitude": 45.0355, "longitude": 38.9753},  # Краснодар
    "Красноярский край":
    {"latitude": 56.0153, "longitude": 92.8932},  # Красноярск
    "Ленинградская область":
    {"latitude": 59.5702, "longitude": 31.2200},  # Санкт-Петербург (центр региона)
    "Москва":
    {"latitude": 55.7558, "longitude": 37.6173},  # Москва
    "Московская область": 
    {"latitude": 55.5186, "longitude": 37.6294},  # Красногорск (адм. центр)
    "Мурманская область": 
    {"latitude": 68.9585, "longitude": 33.0827},  # Мурманск
    "Нижегородская область": 
    {"latitude": 56.2965, "longitude": 43.9361},  # Нижний Новгород
    "Новосибирская область": 
    {"latitude": 55.0415, "longitude": 82.9346},  # Новосибирск
    "Омская область": 
    {"latitude": 54.9924, "longitude": 73.3686},  # Омск
    "Оренбургская область": 
    {"latitude": 51.7682, "longitude": 55.0968},  # Оренбург
    "Пензенская область": 
    {"latitude": 53.1959, "longitude": 45.0182},  # Пенза
    "Пермский край": 
    {"latitude": 58.0105, "longitude": 56.2502},  # Пермь
    "Приморский край": 
    {"latitude": 43.1155, "longitude": 131.8855},  # Владивосток
    "Республика Башкортостан": 
    {"latitude": 54.7348, "longitude": 55.9579},  # Уфа
    "Республика Бурятия": 
    {"latitude": 51.8333, "longitude": 107.5833},  # Улан-Удэ
    "Республика Дагестан": 
    {"latitude": 42.9849, "longitude": 47.5046},  # Махачкала
    "Республика Карелия": 
    {"latitude": 61.7833, "longitude": 34.3500},  # Петрозаводск
    "Республика Саха (Якутия)": 
    {"latitude": 62.0355, "longitude": 129.6755},  # Якутск
    "Республика Северная Осетия - Алания": 
    {"latitude": 43.0000, "longitude": 44.6667},  # Владикавказ
    "Республика Татарстан (Татарстан)": 
    {"latitude": 55.7961, "longitude": 49.1064},  # Казань
    "Ростовская область": 
    {"latitude": 47.2357, "longitude": 39.7015},  # Ростов-на-Дону
    "Рязанская область": 
    {"latitude": 54.6261, "longitude": 39.6916},  # Рязань
    "Самарская область": 
    {"latitude": 53.1959, "longitude": 50.1000},  # Самара
    "Санкт-Петербург": 
    {"latitude": 59.9343, "longitude": 30.3351},  # Санкт-Петербург
    "Саратовская область": 
    {"latitude": 51.5336, "longitude": 46.0342},  # Саратов
    "Свердловская область": 
    {"latitude": 56.8389, "longitude": 60.6057},  # Екатеринбург
    "Смоленская область": 
    {"latitude": 54.7823, "longitude": 32.0453},  # Смоленск
    "Ставропольский край": 
    {"latitude": 44.9482, "longitude": 41.9351},  # Ставрополь
    "Тверская область": 
    {"latitude": 56.8596, "longitude": 35.9176},  # Тверь
    "Томская область": 
    {"latitude": 56.4977, "longitude": 84.9744},  # Томск
    "Тульская область": 
    {"latitude": 54.2042, "longitude": 37.6116},  # Тула
    "Тюменская область": 
    {"latitude": 57.1522, "longitude": 65.5272},  # Тюмень
    "Ульяновская область":
    {"latitude": 54.3142, "longitude": 48.4030},  # Ульяновск
    "Хабаровский край":
    {"latitude": 48.4820, "longitude": 135.0837},  # Хабаровск
    "Ханты-Мансийский автономный округ - Югра":
    {"latitude": 61.0039, "longitude": 69.0011},  # Ханты-Мансийск
    "Челябинская область":
    {"latitude": 55.1644, "longitude": 61.4368},  # Челябинск
    "Чеченская Республика":
    {"latitude": 43.3178, "longitude": 45.6983},  # Грозный
    "Чувашская Республика - Чувашия":
    {"latitude": 56.1328, "longitude": 47.2510},  # Чебоксары
    "Ярославская область":
    {"latitude": 57.6261, "longitude": 39.8845}  # Ярославль
}
